In [1]:

import pandas as pd
dict={"Fruits":["Apple","Mango","Banana","Orange"],"Price":[100,120,130,110],"Quantity":[10,11,12,13]}
df=pd.DataFrame(dict)
print(df)

   Fruits  Price  Quantity
0   Apple    100        10
1   Mango    120        11
2  Banana    130        12
3  Orange    110        13

In [2]:
df2=df.copy()
df2.loc[0,"Price"]=150
df2.loc[2,"Price"]=100
df2.loc[1,"Quantity"]=20
df2.loc[3,"Quantity"]=15
print(df2)

   Fruits  Price  Quantity
0   Apple    150        10
1   Mango    120        20
2  Banana    100        12
3  Orange    110        15

In [3]:
df.compare(df2)

   Price        Quantity
    self  other     self other
0  100.0  150.0      NaN   NaN
1    NaN    NaN     11.0  20.0
2  130.0  100.0      NaN   NaN
3    NaN    NaN     13.0  15.0

In [4]:
df.compare(df2,align_axis=0)

         Price  Quantity
0 self   100.0       NaN
  other  150.0       NaN
1 self     NaN      11.0
  other    NaN      20.0
2 self   130.0       NaN
  other  100.0       NaN
3 self     NaN      13.0
  other    NaN      15.0

In [5]:
df.compare(df2,keep_equal=True)

  Price       Quantity
   self other     self other
0   100   150       10    10
1   120   120       11    20
2   130   100       12    12
3   110   110       13    15

In [6]:
df.compare(df2,keep_shape=True)

  Fruits        Price        Quantity
    self other   self  other     self other
0    NaN   NaN  100.0  150.0      NaN   NaN
1    NaN   NaN    NaN    NaN     11.0  20.0
2    NaN   NaN  130.0  100.0      NaN   NaN
3    NaN   NaN    NaN    NaN     13.0  15.0